Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
beacon.aws_api_gateway_method.biosamples-id-analyses: Refreshing state... [id=agm-sse4jppfz8-5z5zup-GET]
module.sbeacon.aws_api_gateway_method.individuals-id-g_variants: Refreshing state... [id=agm-sse4jppfz8-3p7266-GET]
module.sbeacon.aws_api_gateway_method.biosamples-id-g_variants_post: Refreshing state... [id=agm-sse4jppfz8-5pywyj-POST]
module.sbeacon.aws_api_gateway_method.runs: Refreshing state... [id=agm-sse4jppfz8-6nxeg0-GET]
module.sbeacon.aws_api_gateway_method.runs-filtering_terms_post: Refreshing state... [id=agm-sse4jppfz8-k5ywtx-POST]
module.sbeacon.aws_api_gateway_method.individuals_post: Refreshing state... [id=agm-sse4jppfz8-tszbth-POST]
module.sbeacon.aws_api_gateway_method.datasets-id-filtering_terms_post: Refreshing state... [id=agm-sse4jppfz8-pjr8lx-POST]
module.sbeacon.aws_api_gateway_method.datasets-id-g_variants_post: Refreshing state... [id=agm-sse4jppfz8-p0v24v-POST]
module.sbeacon.aws_api_gateway_method.individuals-id-biosamples: Refreshing state... [id=agm-sse4jppfz8-cbna1t-GET]
module.sbeacon.aws_api_gateway_method.individuals-filtering_terms_post: Refreshing state... [id=agm-sse4jppfz8-2jwps9-POST]
module.sbeacon.aws_api_gateway_method.datasets_post: Refreshing state... [id=agm-sse4jppfz8-7qllhx-POST]
module.sbeacon.aws_api_gateway_method.individuals: Refreshing state... [id=agm-sse4jppfz8-tszbth-GET]
module.sbeacon.aws_api_gateway_method.runs-id-g_variants: Refreshing state... [id=agm-sse4jppfz8-ih2jru-GET]
module.sbeacon.aws_api_gateway_method.biosamples: Refreshing state... [id=agm-sse4jppfz8-yhw4hz-GET]
module.sbeacon.aws_api_gateway_method.g_variants-id-biosamples: Refreshing state... [id=agm-sse4jppfz8-eu5xf3-GET]
module.sbeacon.aws_api_gateway_method.datasets-id-filtering_terms: Refreshing state... [id=agm-sse4jppfz8-pjr8lx-GET]
module.sbeacon.aws_api_gateway_method.g_variants-id-individuals: Refreshing state... [id=agm-sse4jppfz8-ngo9l8-GET]
module.sbeacon.aws_api_gateway_method.runs-id-analyses_post: Refreshing state... [id=agm-sse4jppfz8-rt4ilc-POST]
module.sbeacon.aws_api_gateway_method.datasets-id: Refreshing state... [id=agm-sse4jppfz8-988914-GET]
module.sbeacon.aws_api_gateway_method.individuals-id: Refreshing state... [id=agm-sse4jppfz8-2jfdqa-GET]
module.sbeacon.aws_api_gateway_method.individuals-id-biosamples_post: Refreshing state... [id=agm-sse4jppfz8-cbna1t-POST]
module.sbeacon.aws_api_gateway_method.analyses-id_post: Refreshing state... [id=agm-sse4jppfz8-m5i90n-POST]
module.sbeacon.module.lambda-splitQuery.aws_iam_role_policy.additional_json[0]: Refreshing state... [id=sbeacon-backend-splitQuery:sbeacon-backend-splitQuery]
module.svep[0].module.lambda-queryVCF.aws_iam_policy.additional[0]: Refreshing state... [id=arn:aws:iam::127214202110:policy/svep-backend-queryVCF]
module.svep[0].aws_api_gateway_method.vcfstats-patch: Refreshing state... [id=agm-49hervuih0-g3m5jp-PATCH]
module.svep[0].aws_api_gateway_method.submit-patch: Refreshing state... [id=agm-49hervuih0-ww21x7-PATCH]
module.svep[0].aws_api_gateway_method.results-get: Refreshing state... [id=agm-49hervuih0-dkhqay-GET]
module.svep[0].aws_api_gateway_method.vcfstats-post: Refreshing state... [id=agm-49hervuih0-g3m5jp-POST]
module.svep[0].aws_api_gateway_method.submit-post: Refreshing state... [id=agm-49hervuih0-ww21x7-POST]
module.cognito.data.aws_iam_policy_document.gaspi_authenticated: Reading...
module.cognito.data.aws_iam_policy_document.gaspi_authenticated: Read complete after 0s [id=1407985118]
module.cognito.data.aws_iam_policy_document.gaspi_unauthenticated: Reading...
module.cognito.data.aws_iam_policy_document.gaspi_unauthenticated: Read complete after 0s [id=3174580420]
module.cognito.data.aws_iam_policy_document.manager_group_assume_role_policy: Reading...
module.cognito.data.aws_iam_policy_document.manager_group_assume_role_policy: Read complete after 0s [id=1407985118]
module.cognito.data.aws_iam_policy_document.admin_group_assume_role_policy: Reading...
module.cognito.data.aws_iam_policy_document.admin_group_assume_role_policy: Read complete after 0s [id=1407985118]
module.svep[0].module.lambda-initQuery.aws_iam_policy.additional[0]: Refreshing state... [id=arn:aws:iam::127214202110:policy/svep-backend-initQuery]
module.svep[0].module.lambda-concatStarter.aws_iam_policy.additional[0]: Refreshing state... [id=arn:aws:iam::127214202110:policy/svep-backend-concatStarter]
module.svep[0].module.lambda-concat.aws_iam_policy.additional[0]: Refreshing state... [id=arn:aws:iam::127214202110:policy/svep-backend-concat]
module.svep[0].module.lambda-queryGTF.aws_iam_policy.additional[0]: Refreshing state... [id=arn:aws:iam::127214202110:policy/svep-backend-queryGTF]
module.svep[0].module.lambda-formatOutput.aws_iam_policy.additional[0]: Refreshing state... [id=arn:aws:iam::127214202110:policy/svep-backend-formatOutput]
module.svep[0].module.lambda-sendJobEmail.aws_iam_policy.additional[0]: Refreshing state... [id=arn:aws:iam::127214202110:policy/svep-backend-sendJobEmail]
module.svep[0].module.lambda-pluginClinvar.aws_iam_policy.additional[0]: Refreshing state... [id=arn:aws:iam::127214202110:policy/svep-backend-pluginClinvar]
module.svep[0].module.lambda-concatPages.aws_iam_policy.additional[0]: Refreshing state... [id=arn:aws:iam::127214202110:policy/svep-backend-concatPages]
module.svep[0].module.lambda-createPages.aws_iam_policy.additional[0]: Refreshing state... [id=arn:aws:iam::127214202110:policy/svep-backend-createPages]
module.svep[0].module.lambda-pluginConsequence.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=svep-backend-pluginConsequence:svep-backend-pluginConsequence-0]
module.svep[0].module.lambda-queryVCFsubmit.aws_iam_policy.additional[0]: Refreshing state... [id=arn:aws:iam::127214202110:policy/svep-backend-queryVCFsubmit]
module.sbeacon.module.lambda-admin.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-admin:sbeacon-backend-admin-0]
module.sbeacon.module.lambda-generateCohortVCfs.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-generateCohortVCfs:sbeacon-backend-generateCohortVCfs-0]
module.sbeacon.module.lambda-generateCohortVCfs.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-generateCohortVCfs:sbeacon-backend-generateCohortVCfs-1]
module.sbeacon.module.lambda-generateCohortVCfs.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-generateCohortVCfs:sbeacon-backend-generateCohortVCfs-2]
module.svep[0].module.lambda-pluginGnomad.aws_iam_policy.additional[0]: Refreshing state... [id=arn:aws:iam::127214202110:policy/svep-backend-pluginGnomad]
module.sbeacon.aws_api_gateway_method_response.biosamples_post: Refreshing state... [id=agmr-sse4jppfz8-yhw4hz-POST-200]
module.sbeacon.aws_api_gateway_method_response.g_variants-id-biosamples_post: Refreshing state... [id=agmr-sse4jppfz8-eu5xf3-POST-200]
module.sbeacon.aws_api_gateway_method_response.datasets: Refreshing state... [id=agmr-sse4jppfz8-7qllhx-GET-200]
module.sbeacon.aws_api_gateway_method_response.admin_proxy: Refreshing state... [id=agmr-sse4jppfz8-yrayho-ANY-200]
module.sbeacon.aws_api_gateway_method_response.runs-id_post: Refreshing state... [id=agmr-sse4jppfz8-fps4t7-POST-200]
module.sbeacon.aws_api_gateway_method_response.biosamples-id-runs: Refreshing state... [id=agmr-sse4jppfz8-0omln3-GET-200]
module.sbeacon.aws_api_gateway_method_response.g_variants-id-individuals_post: Refreshing state... [id=agmr-sse4jppfz8-ngo9l8-POST-200]
module.sbeacon.aws_api_gateway_method_response.analyses-id-g_variants_post: Refreshing state... [id=agmr-sse4jppfz8-q3gd41-POST-200]
module.sbeacon.aws_api_gateway_method_response.datasets-id-biosamples_post: Refreshing state... [id=agmr-sse4jppfz8-gwc4y7-POST-200]
module.sbeacon.aws_api_gateway_method_response.root-get: Refreshing state... [id=agmr-sse4jppfz8-d7i405w57f-GET-200]
module.sbeacon.aws_api_gateway_integration.root-get: Refreshing state... [id=agi-sse4jppfz8-d7i405w57f-GET]
module.sbeacon.aws_api_gateway_method_response.biosamples-filtering_terms: Refreshing state... [id=agmr-sse4jppfz8-p8fp4p-GET-200]
module.sbeacon.aws_api_gateway_method_response.configuration: Refreshing state... [id=agmr-sse4jppfz8-zceely-GET-200]
module.sbeacon.aws_api_gateway_integration.configuration: Refreshing state... [id=agi-sse4jppfz8-zceely-GET]
module.sbeacon.aws_api_gateway_method_response.entry_types: Refreshing state... [id=agmr-sse4jppfz8-xx70sd-GET-200]
module.sbeacon.aws_api_gateway_integration.entry_types: Refreshing state... [id=agi-sse4jppfz8-xx70sd-GET]
module.sbeacon.aws_api_gateway_method_response.runs-id: Refreshing state... [id=agmr-sse4jppfz8-fps4t7-GET-200]
module.sbeacon.aws_api_gateway_method_response.g_variants_post: Refreshing state... [id=agmr-sse4jppfz8-xadyn3-POST-200]
module.sbeacon.aws_api_gateway_method_response.analyses: Refreshing state... [id=agmr-sse4jppfz8-ix2myj-GET-200]
module.sbeacon.aws_api_gateway_method_response.g_variants-id_post: Refreshing state... [id=agmr-sse4jppfz8-4k5xwj-POST-200]
module.sbeacon.aws_api_gateway_method_response.runs_post: Refreshing state... [id=agmr-sse4jppfz8-6nxeg0-POST-200]
module.sbeacon.aws_api_gateway_method_response.map: Refreshing state... [id=agmr-sse4jppfz8-2bkfl5-GET-200]
module.sbeacon.aws_api_gateway_integration.map: Refreshing state... [id=agi-sse4jppfz8-2bkfl5-GET]
module.sbeacon.aws_api_gateway_method_response.runs-id-g_variants_post: Refreshing state... [id=agmr-sse4jppfz8-ih2jru-POST-200]
module.sbeacon.aws_api_gateway_method_response.individuals-filtering_terms: Refreshing state... [id=agmr-sse4jppfz8-2jwps9-GET-200]
module.sbeacon.aws_api_gateway_method_response.analyses-filtering_terms: Refreshing state... [id=agmr-sse4jppfz8-eylaw8-GET-200]
module.sbeacon.aws_api_gateway_integration.filtering_terms: Refreshing state... [id=agi-sse4jppfz8-q86gdu-GET]
module.sbeacon.aws_api_gateway_method_response.filtering_terms: Refreshing state... [id=agmr-sse4jppfz8-q86gdu-GET-200]
module.sbeacon.aws_api_gateway_method_response.datasets-id-individuals: Refreshing state... [id=agmr-sse4jppfz8-hbsf0m-GET-200]
module.sbeacon.aws_api_gateway_method_response.dportal_proxy: Refreshing state... [id=agmr-sse4jppfz8-jsr0cp-ANY-200]
module.sbeacon.aws_api_gateway_method_response.datasets-id-individuals_post: Refreshing state... [id=agmr-sse4jppfz8-hbsf0m-POST-200]
module.sbeacon.aws_api_gateway_method_response.datasets-id_post: Refreshing state... [id=agmr-sse4jppfz8-988914-POST-200]
module.sbeacon.aws_api_gateway_method_response.datasets-filtering_terms_post: Refreshing state... [id=agmr-sse4jppfz8-gwxbpd-POST-200]
module.sbeacon.aws_api_gateway_method_response.individuals-id-g_variants_post: Refreshing state... [id=agmr-sse4jppfz8-3p7266-POST-200]
module.sbeacon.aws_api_gateway_method_response.biosamples-filtering_terms_post: Refreshing state... [id=agmr-sse4jppfz8-p8fp4p-POST-200]
module.sbeacon.aws_api_gateway_method_response.analyses-filtering_terms_post: Refreshing state... [id=agmr-sse4jppfz8-eylaw8-POST-200]
module.sbeacon.aws_api_gateway_method_response.g_variants: Refreshing state... [id=agmr-sse4jppfz8-xadyn3-GET-200]
module.sbeacon.aws_api_gateway_method_response.analyses-id: Refreshing state... [id=agmr-sse4jppfz8-m5i90n-GET-200]
module.sbeacon.aws_api_gateway_method_response.biosamples-id_post: Refreshing state... [id=agmr-sse4jppfz8-cj0t4v-POST-200]
module.sbeacon.aws_api_gateway_method_response.analyses_post: Refreshing state... [id=agmr-sse4jppfz8-ix2myj-POST-200]
module.sbeacon.aws_api_gateway_method_response.biosamples-id-runs_post: Refreshing state... [id=agmr-sse4jppfz8-0omln3-POST-200]
module.sbeacon.aws_api_gateway_method_response.biosamples-id: Refreshing state... [id=agmr-sse4jppfz8-cj0t4v-GET-200]
module.sbeacon.aws_api_gateway_method_response.datasets-filtering_terms: Refreshing state... [id=agmr-sse4jppfz8-gwxbpd-GET-200]
module.sbeacon.aws_api_gateway_method_response.info: Refreshing state... [id=agmr-sse4jppfz8-sjzxnk-GET-200]
module.sbeacon.aws_api_gateway_integration.info: Refreshing state... [id=agi-sse4jppfz8-sjzxnk-GET]
module.sbeacon.aws_api_gateway_method_response.biosamples-id-analyses_post: Refreshing state... [id=agmr-sse4jppfz8-5z5zup-POST-200]
module.sbeacon.aws_api_gateway_method_response.biosamples-id-g_variants: Refreshing state... [id=agmr-sse4jppfz8-5pywyj-GET-200]
module.sbeacon.aws_api_gateway_method_response.biosamples-id-analyses: Refreshing state... [id=agmr-sse4jppfz8-5z5zup-GET-200]
module.sbeacon.aws_api_gateway_method_response.analyses-id-g_variants: Refreshing state... [id=agmr-sse4jppfz8-q3gd41-GET-200]
module.sbeacon.aws_api_gateway_method_response.biosamples-id-g_variants_post: Refreshing state... [id=agmr-sse4jppfz8-5pywyj-POST-200]
module.sbeacon.aws_api_gateway_method_response.g_variants-id: Refreshing state... [id=agmr-sse4jppfz8-4k5xwj-GET-200]
module.sbeacon.aws_api_gateway_method_response.individuals-id_post: Refreshing state... [id=agmr-sse4jppfz8-2jfdqa-POST-200]
module.sbeacon.aws_api_gateway_method_response.runs-filtering_terms_post: Refreshing state... [id=agmr-sse4jppfz8-k5ywtx-POST-200]
module.sbeacon.aws_api_gateway_method_response.datasets-id-biosamples: Refreshing state... [id=agmr-sse4jppfz8-gwc4y7-GET-200]
module.sbeacon.aws_api_gateway_method_response.datasets-id-g_variants_post: Refreshing state... [id=agmr-sse4jppfz8-p0v24v-POST-200]
module.sbeacon.aws_api_gateway_method_response.individuals-id-g_variants: Refreshing state... [id=agmr-sse4jppfz8-3p7266-GET-200]
module.sbeacon.aws_api_gateway_method_response.individuals-filtering_terms_post: Refreshing state... [id=agmr-sse4jppfz8-2jwps9-POST-200]
module.sbeacon.aws_api_gateway_method_response.datasets_post: Refreshing state... [id=agmr-sse4jppfz8-7qllhx-POST-200]
module.sbeacon.aws_api_gateway_method_response.runs: Refreshing state... [id=agmr-sse4jppfz8-6nxeg0-GET-200]
module.sbeacon.aws_api_gateway_method_response.runs-id-analyses: Refreshing state... [id=agmr-sse4jppfz8-rt4ilc-GET-200]
module.sbeacon.aws_api_gateway_method_response.biosamples: Refreshing state... [id=agmr-sse4jppfz8-yhw4hz-GET-200]
module.sbeacon.aws_api_gateway_method_response.datasets-id-filtering_terms_post: Refreshing state... [id=agmr-sse4jppfz8-pjr8lx-POST-200]
module.sbeacon.aws_api_gateway_method_response.datasets-id-filtering_terms: Refreshing state... [id=agmr-sse4jppfz8-pjr8lx-GET-200]
module.sbeacon.aws_api_gateway_method_response.g_variants-id-individuals: Refreshing state... [id=agmr-sse4jppfz8-ngo9l8-GET-200]
module.sbeacon.aws_api_gateway_method_response.datasets-id: Refreshing state... [id=agmr-sse4jppfz8-988914-GET-200]
module.sbeacon.aws_api_gateway_method_response.individuals-id: Refreshing state... [id=agmr-sse4jppfz8-2jfdqa-GET-200]
module.sbeacon.aws_api_gateway_method_response.individuals-id-biosamples_post: Refreshing state... [id=agmr-sse4jppfz8-cbna1t-POST-200]
module.sbeacon.aws_api_gateway_method_response.analyses-id_post: Refreshing state... [id=agmr-sse4jppfz8-m5i90n-POST-200]
module.sbeacon.module.lambda-splitQuery.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-splitQuery]
module.sbeacon.aws_api_gateway_method_response.individuals-id-biosamples: Refreshing state... [id=agmr-sse4jppfz8-cbna1t-GET-200]
module.svep[0].aws_api_gateway_method_response.vcfstats-patch: Refreshing state... [id=agmr-49hervuih0-g3m5jp-PATCH-200]
module.svep[0].aws_api_gateway_method_response.submit-patch: Refreshing state... [id=agmr-49hervuih0-ww21x7-PATCH-200]
module.svep[0].aws_api_gateway_integration.results-get: Refreshing state... [id=agi-49hervuih0-dkhqay-GET]
module.svep[0].aws_api_gateway_method_response.results-get: Refreshing state... [id=agmr-49hervuih0-dkhqay-GET-200]
module.sbeacon.aws_api_gateway_method_response.individuals: Refreshing state... [id=agmr-sse4jppfz8-tszbth-GET-200]
module.svep[0].aws_api_gateway_method_response.vcfstats-post: Refreshing state... [id=agmr-49hervuih0-g3m5jp-POST-200]
module.cognito.aws_iam_role.gaspi_authenticated: Refreshing state... [id=gaspi_authenticated]
module.cognito.aws_iam_role.gaspi_unauthenticated: Refreshing state... [id=gaspi_unauthenticated]
module.cognito.aws_iam_role.manager_group_role: Refreshing state... [id=gaspi-manager-group-role]
module.cognito.aws_iam_role.admin_group_role: Refreshing state... [id=gaspi-admin-group-role]
module.svep[0].aws_sns_topic_subscription.pluginGnomad: Refreshing state... [id=arn:aws:sns:ap-southeast-3:127214202110:svep-backend-pluginGnomad:2239477f-23b2-4b23-839f-9da614f5f066]
module.svep[0].aws_lambda_permission.plugin_plugin_gnomad_invoke_permission: Refreshing state... [id=SNSPluginGnomadAllowInvoke]
module.svep[0].aws_api_gateway_integration.submit-patch: Refreshing state... [id=agi-49hervuih0-ww21x7-PATCH]
module.svep[0].aws_lambda_function_recursion_config.init_query_recursion: Refreshing state...
module.svep[0].aws_lambda_permission.init_query_invoke_permission: Refreshing state... [id=APIInitQueryAllowInvoke]
module.svep[0].aws_api_gateway_method_response.submit-post: Refreshing state... [id=agmr-49hervuih0-ww21x7-POST-200]
module.svep[0].aws_api_gateway_integration.submit-post: Refreshing state... [id=agi-49hervuih0-ww21x7-POST]
module.svep[0].aws_lambda_permission.vcfstats_graphic_invoke_permission: Refreshing state... [id=APIVcfstatsAllowInvoke]
module.svep[0].aws_api_gateway_integration.vcfstats-patch: Refreshing state... [id=agi-49hervuih0-g3m5jp-PATCH]
module.svep[0].aws_api_gateway_integration.vcfstats-post: Refreshing state... [id=agi-49hervuih0-g3m5jp-POST]
module.svep[0].aws_sns_topic_subscription.formatOutput: Refreshing state... [id=arn:aws:sns:ap-southeast-3:127214202110:svep-backend-formatOutput:33d1e261-b3aa-4238-aca3-5702eb55ec08]
module.svep[0].aws_lambda_permission.formatOutput_invoke_permission: Refreshing state... [id=SNSformatOutputAllowInvoke]
module.svep[0].aws_lambda_permission.plugin_clinvar_invoke_permission: Refreshing state... [id=SNSPluginClinvarAllowInvoke]
module.svep[0].aws_sns_topic_subscription.pluginClinvar: Refreshing state... [id=arn:aws:sns:ap-southeast-3:127214202110:svep-backend-pluginClinvar:512a20ca-5f7b-439b-b5ee-d392749ccdd4]
module.svep[0].aws_lambda_permission.create_pages_invoke_permission: Refreshing state... [id=SNSCreatePagesAllowInvoke]
module.svep[0].aws_lambda_function_recursion_config.create_pages_recursion: Refreshing state...
module.svep[0].aws_sns_topic_subscription.createPages: Refreshing state... [id=arn:aws:sns:ap-southeast-3:127214202110:svep-backend-createPages:ba90be0c-fbbc-46aa-9a5a-48ac23e52818]
module.svep[0].aws_lambda_permission.plugin_send_job_email_invoke_permission: Refreshing state... [id=SNSSendJobEmailAllowInvoke]
module.svep[0].aws_sns_topic_subscription.sendJobEmail: Refreshing state... [id=arn:aws:sns:ap-southeast-3:127214202110:svep-backend-sendJobEmail:43ff12f3-8acd-4336-b655-22c63bcaf67d]
module.svep[0].aws_sns_topic_subscription.concat: Refreshing state... [id=arn:aws:sns:ap-southeast-3:127214202110:svep-backend-concat:d3dcd484-c647-4343-b363-f12ef33a166d]
module.svep[0].aws_lambda_permission.concat_invoke_permission: Refreshing state... [id=SNSConcatAllowInvoke]
module.svep[0].aws_sns_topic_subscription.concatStarter: Refreshing state... [id=arn:aws:sns:ap-southeast-3:127214202110:svep-backend-concatStarter:b0b8607f-c0a0-4e21-a090-aa70c857f0fc]
module.svep[0].aws_lambda_permission.concat_starter_invoke_permission: Refreshing state... [id=SNSConcatStarterAllowInvoke]
module.svep[0].aws_lambda_function_recursion_config.concat_starter_recursion: Refreshing state...
module.svep[0].module.lambda-queryVCF.aws_iam_policy_attachment.additional[0]: Refreshing state... [id=svep-backend-queryVCF]
module.svep[0].aws_sns_topic_subscription.queryVCFsubmit: Refreshing state... [id=arn:aws:sns:ap-southeast-3:127214202110:svep-backend-queryVCFsubmit:64ee128f-16c8-4333-859e-d4c1bfa776e1]
module.svep[0].aws_lambda_permission.query_vcf_submit_invoke_permission: Refreshing state... [id=SNSQueryVCFSubmitAllowInvoke]
module.sbeacon.aws_api_gateway_method_response.g_variants-id-biosamples: Refreshing state... [id=agmr-sse4jppfz8-eu5xf3-GET-200]
module.sbeacon.aws_api_gateway_method_response.runs-id-analyses_post: Refreshing state... [id=agmr-sse4jppfz8-rt4ilc-POST-200]
module.svep[0].module.lambda-initQuery.aws_iam_policy_attachment.additional[0]: Refreshing state... [id=svep-backend-initQuery]
module.svep[0].module.lambda-concatStarter.aws_iam_policy_attachment.additional[0]: Refreshing state... [id=svep-backend-concatStarter]
module.svep[0].module.lambda-concat.aws_iam_policy_attachment.additional[0]: Refreshing state... [id=svep-backend-concat]
module.svep[0].module.lambda-queryGTF.aws_iam_policy_attachment.additional[0]: Refreshing state... [id=svep-backend-queryGTF]
module.svep[0].module.lambda-formatOutput.aws_iam_policy_attachment.additional[0]: Refreshing state... [id=svep-backend-formatOutput]
module.svep[0].module.lambda-sendJobEmail.aws_iam_policy_attachment.additional[0]: Refreshing state... [id=svep-backend-sendJobEmail]
module.svep[0].module.lambda-pluginClinvar.aws_iam_policy_attachment.additional[0]: Refreshing state... [id=svep-backend-pluginClinvar]
module.svep[0].module.lambda-pluginConsequence.aws_lambda_function.this[0]: Refreshing state... [id=svep-backend-pluginConsequence]
module.svep[0].module.lambda-concatPages.aws_iam_policy_attachment.additional[0]: Refreshing state... [id=svep-backend-concatPages]
module.svep[0].module.lambda-createPages.aws_iam_policy_attachment.additional[0]: Refreshing state... [id=svep-backend-createPages]
module.svep[0].aws_lambda_permission.query_gtf_invoke_permission: Refreshing state... [id=SNSQueryGTFAllowInvoke]
module.svep[0].aws_lambda_function_recursion_config.query_gtf_recursion: Refreshing state...
module.svep[0].aws_sns_topic_subscription.queryGTF: Refreshing state... [id=arn:aws:sns:ap-southeast-3:127214202110:svep-backend-queryGTF:6beee7a7-c362-42e8-b399-3b1b0c83b207]
module.svep[0].aws_lambda_permission.query_vcf_invoke_permission: Refreshing state... [id=SNSQueryVCFAllowInvoke]
module.svep[0].aws_lambda_function_recursion_config.query_vcf_recursion: Refreshing state...
module.svep[0].aws_sns_topic_subscription.queryVCF: Refreshing state... [id=arn:aws:sns:ap-southeast-3:127214202110:svep-backend-queryVCF:f3c1ca11-b793-4735-bfc6-b9509a236321]
module.svep[0].aws_sns_topic_subscription.concatPages: Refreshing state... [id=arn:aws:sns:ap-southeast-3:127214202110:svep-backend-concatPages:76f53135-f918-484f-ba01-ab128c7ce5c6]
module.svep[0].aws_lambda_permission.concat_pages_invoke_permission: Refreshing state... [id=SNSConcatPagesAllowInvoke]
module.sbeacon.module.lambda-generateCohortVCfs.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-generateCohortVCfs]
module.sbeacon.module.cors-info-root.aws_api_gateway_method._: Refreshing state... [id=agm-sse4jppfz8-d7i405w57f-OPTIONS]
module.svep[0].module.lambda-queryVCFsubmit.aws_iam_policy_attachment.additional[0]: Refreshing state... [id=svep-backend-queryVCFsubmit]
module.sbeacon.aws_api_gateway_integration_response.configuration: Refreshing state... [id=agir-sse4jppfz8-zceely-GET-200]
module.sbeacon.aws_api_gateway_integration_response.entry_types: Refreshing state... [id=agir-sse4jppfz8-xx70sd-GET-200]
module.svep[0].module.lambda-pluginGnomad.aws_iam_policy_attachment.additional[0]: Refreshing state... [id=svep-backend-pluginGnomad]
module.sbeacon.aws_api_gateway_integration_response.filtering_terms: Refreshing state... [id=agir-sse4jppfz8-q86gdu-GET-200]
module.sbeacon.aws_api_gateway_method_response.individuals_post: Refreshing state... [id=agmr-sse4jppfz8-tszbth-POST-200]
module.sbeacon.aws_api_gateway_integration_response.root-get: Refreshing state... [id=agir-sse4jppfz8-d7i405w57f-GET-200]
module.sbeacon.aws_api_gateway_method_response.runs-id-g_variants: Refreshing state... [id=agmr-sse4jppfz8-ih2jru-GET-200]
module.sbeacon.aws_api_gateway_integration_response.map: Refreshing state... [id=agir-sse4jppfz8-2bkfl5-GET-200]
module.sbeacon.aws_api_gateway_integration_response.info: Refreshing state... [id=agir-sse4jppfz8-sjzxnk-GET-200]
module.svep[0].aws_api_gateway_integration_response.results-get: Refreshing state... [id=agir-49hervuih0-dkhqay-GET-200]
module.svep[0].aws_api_gateway_integration_response.submit-patch: Refreshing state... [id=agir-49hervuih0-ww21x7-PATCH-200]
module.cognito.aws_iam_role_policy.gaspi_authenticated: Refreshing state... [id=gaspi_authenticated:authenticated_policy]
module.svep[0].aws_api_gateway_integration_response.submit-post: Refreshing state... [id=agir-49hervuih0-ww21x7-POST-200]
module.svep[0].aws_api_gateway_integration_response.vcfstats-patch: Refreshing state... [id=agir-49hervuih0-g3m5jp-PATCH-200]
module.cognito.aws_iam_role_policy.gaspi_unauthenticated: Refreshing state... [id=gaspi_unauthenticated:unauthenticated_policy]
module.cognito.aws_cognito_identity_pool_roles_attachment.gaspi_cognito_roles: Refreshing state... [id=ap-southeast-3:cc22636c-2c3c-4c75-9fdf-4fc92cbe5f50]
module.cognito.aws_cognito_user_group.manager_group: Refreshing state... [id=ap-southeast-3_586AXnWYN/managers]
module.cognito.aws_iam_role_policy_attachment.manager_group_role_policy_attachment: Refreshing state... [id=gaspi-manager-group-role-20250526054747919600000002]
module.cognito.aws_iam_role_policy_attachment.admin_group_role_policy_attachment: Refreshing state... [id=gaspi-admin-group-role-20250526054746798400000001]
module.cognito.aws_cognito_user_group.admin_group: Refreshing state... [id=ap-southeast-3_586AXnWYN/administrators]
module.sbeacon.module.cors-info-root.aws_api_gateway_integration._: Refreshing state... [id=agi-sse4jppfz8-d7i405w57f-OPTIONS]
module.sbeacon.module.cors-info-root.aws_api_gateway_method_response._: Refreshing state... [id=agmr-sse4jppfz8-d7i405w57f-OPTIONS-200]
module.sbeacon.data.aws_iam_policy_document.lambda-getBiosamples: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-getBiosamples: Read complete after 0s [id=165438818]
module.sbeacon.aws_sns_topic_subscription.splitQuery: Refreshing state... [id=arn:aws:sns:ap-southeast-3:127214202110:splitQuery:72abee17-e4ce-4d18-92af-71a8d9c796b3]
module.sbeacon.data.aws_iam_policy_document.lambda-getAnalyses: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-getAnalyses: Read complete after 0s [id=165438818]
module.sbeacon.data.aws_iam_policy_document.lambda-getIndividuals: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-getIndividuals: Read complete after 0s [id=165438818]
module.sbeacon.aws_lambda_permission.SNSsplitQuery: Refreshing state... [id=SBeaconBackendAllowSNSsplitQueryInvoke]
module.sbeacon.data.aws_iam_policy_document.lambda-getRuns: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-getRuns: Read complete after 0s [id=165438818]
module.sbeacon.data.aws_iam_policy_document.lambda-getDatasets: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-getDatasets: Read complete after 0s [id=165438818]
module.sbeacon.data.aws_iam_policy_document.lambda-getGenomicVariants: Reading...
module.sbeacon.data.aws_iam_policy_document.lambda-getGenomicVariants: Read complete after 0s [id=3878116413]
module.cognito.aws_cognito_user_in_group.admin_in_admin_group: Refreshing state... [id=terraform-20250526054809411200000003]
module.svep[0].aws_sns_topic_subscription.pluginConsequence: Refreshing state... [id=arn:aws:sns:ap-southeast-3:127214202110:svep-backend-pluginConsequence:b5c33dc8-a632-49c6-bf9b-93b691839939]
module.svep[0].aws_lambda_function_recursion_config.plugin_consequence_recursion: Refreshing state...
module.svep[0].aws_lambda_permission.plugin_consequence_invoke_permission: Refreshing state... [id=SNSPluginConsequenceAllowInvoke]
module.sbeacon.module.cors-info-root.aws_api_gateway_integration_response._: Refreshing state... [id=agir-sse4jppfz8-d7i405w57f-OPTIONS-200]
module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getBiosamples:sbeacon-backend-getBiosamples-0]
module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getBiosamples:sbeacon-backend-getBiosamples-1]
module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getBiosamples:sbeacon-backend-getBiosamples-2]
module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getBiosamples:sbeacon-backend-getBiosamples-3]
module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getAnalyses:sbeacon-backend-getAnalyses-1]
module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getAnalyses:sbeacon-backend-getAnalyses-2]
module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getAnalyses:sbeacon-backend-getAnalyses-3]
module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getAnalyses:sbeacon-backend-getAnalyses-0]
module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getIndividuals:sbeacon-backend-getIndividuals-3]
module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getIndividuals:sbeacon-backend-getIndividuals-0]
module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getIndividuals:sbeacon-backend-getIndividuals-1]
module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getIndividuals:sbeacon-backend-getIndividuals-2]
module.sbeacon.module.lambda-getRuns.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getRuns:sbeacon-backend-getRuns-1]
module.sbeacon.module.lambda-getRuns.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getRuns:sbeacon-backend-getRuns-2]
module.sbeacon.module.lambda-getRuns.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getRuns:sbeacon-backend-getRuns-3]
module.sbeacon.module.lambda-getRuns.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getRuns:sbeacon-backend-getRuns-0]
module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getDatasets:sbeacon-backend-getDatasets-0]
module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getDatasets:sbeacon-backend-getDatasets-2]
module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getDatasets:sbeacon-backend-getDatasets-3]
module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getDatasets:sbeacon-backend-getDatasets-1]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getGenomicVariants:sbeacon-backend-getGenomicVariants-3]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getGenomicVariants:sbeacon-backend-getGenomicVariants-0]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getGenomicVariants:sbeacon-backend-getGenomicVariants-1]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getGenomicVariants:sbeacon-backend-getGenomicVariants-2]
module.sbeacon.module.lambda-data-portal.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-dataPortal:sbeacon-backend-dataPortal-0]
module.sbeacon.module.lambda-data-portal.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-dataPortal:sbeacon-backend-dataPortal-1]
module.sbeacon.module.lambda-getBiosamples.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getBiosamples]
module.sbeacon.module.lambda-getAnalyses.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getAnalyses]
module.svep[0].aws_api_gateway_integration_response.vcfstats-post: Refreshing state... [id=agir-49hervuih0-g3m5jp-POST-200]
module.sbeacon.module.lambda-getIndividuals.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getIndividuals]
module.sbeacon.module.lambda-getRuns.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getRuns]
module.sbeacon.module.lambda-getDatasets.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getDatasets]
module.sbeacon.module.lambda-admin.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-admin]
module.sbeacon.module.lambda-getGenomicVariants.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getGenomicVariants]
module.sbeacon.module.lambda-data-portal.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-dataPortal]
module.sbeacon.aws_lambda_permission.APIbiosamplesFilteringTerms: Refreshing state... [id=AllowAPIbiosamplesFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesIdanalyses: Refreshing state... [id=AllowAPIbiosamplesIdanalysesInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamples: Refreshing state... [id=AllowAPIbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesId: Refreshing state... [id=AllowAPIbiosamplesIdInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesIdg_variants: Refreshing state... [id=AllowAPIbiosamplesIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesIdruns: Refreshing state... [id=AllowAPIbiosamplesIdrunsInvoke]
module.sbeacon.aws_api_gateway_integration.biosamples_post: Refreshing state... [id=agi-sse4jppfz8-yhw4hz-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-filtering_terms: Refreshing state... [id=agi-sse4jppfz8-p8fp4p-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-id: Refreshing state... [id=agi-sse4jppfz8-cj0t4v-GET]
module.sbeacon.aws_api_gateway_integration.biosamples: Refreshing state... [id=agi-sse4jppfz8-yhw4hz-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-id-g_variants: Refreshing state... [id=agi-sse4jppfz8-5pywyj-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-id-analyses_post: Refreshing state... [id=agi-sse4jppfz8-5z5zup-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id-g_variants_post: Refreshing state... [id=agi-sse4jppfz8-5pywyj-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-filtering_terms_post: Refreshing state... [id=agi-sse4jppfz8-p8fp4p-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id-analyses: Refreshing state... [id=agi-sse4jppfz8-5z5zup-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-id_post: Refreshing state... [id=agi-sse4jppfz8-cj0t4v-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id-runs_post: Refreshing state... [id=agi-sse4jppfz8-0omln3-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id-runs: Refreshing state... [id=agi-sse4jppfz8-0omln3-GET]
module.sbeacon.aws_api_gateway_integration.analyses-id-g_variants_post: Refreshing state... [id=agi-sse4jppfz8-q3gd41-POST]
module.sbeacon.aws_api_gateway_integration.analyses-id-g_variants: Refreshing state... [id=agi-sse4jppfz8-q3gd41-GET]
module.sbeacon.aws_api_gateway_integration.analyses_post: Refreshing state... [id=agi-sse4jppfz8-ix2myj-POST]
module.sbeacon.aws_api_gateway_integration.analyses: Refreshing state... [id=agi-sse4jppfz8-ix2myj-GET]
module.sbeacon.aws_api_gateway_integration.analyses-id_post: Refreshing state... [id=agi-sse4jppfz8-m5i90n-POST]
module.sbeacon.aws_api_gateway_integration.analyses-id: Refreshing state... [id=agi-sse4jppfz8-m5i90n-GET]
module.sbeacon.aws_api_gateway_integration.analyses-filtering_terms: Refreshing state... [id=agi-sse4jppfz8-eylaw8-GET]
module.sbeacon.aws_lambda_permission.APIanalysesFilteringTerms: Refreshing state... [id=AllowAPIanalysesFilteringTermsInvoke]
module.sbeacon.aws_api_gateway_integration.analyses-filtering_terms_post: Refreshing state... [id=agi-sse4jppfz8-eylaw8-POST]
module.sbeacon.aws_lambda_permission.APIanalysesIdg_variants: Refreshing state... [id=AllowAPIanalysesIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIanalysesId: Refreshing state... [id=AllowAPIanalysesIdInvoke]
module.sbeacon.aws_lambda_permission.APIanalyses: Refreshing state... [id=AllowAPIanalysesInvoke]
module.sbeacon.aws_api_gateway_integration_response.biosamples_post: Refreshing state... [id=agir-sse4jppfz8-yhw4hz-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-filtering_terms: Refreshing state... [id=agir-sse4jppfz8-p8fp4p-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id: Refreshing state... [id=agir-sse4jppfz8-cj0t4v-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples: Refreshing state... [id=agir-sse4jppfz8-yhw4hz-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-analyses_post: Refreshing state... [id=agir-sse4jppfz8-5z5zup-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-filtering_terms_post: Refreshing state... [id=agir-sse4jppfz8-p8fp4p-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-g_variants_post: Refreshing state... [id=agir-sse4jppfz8-5pywyj-POST-200]
module.sbeacon.aws_api_gateway_integration.individuals_post: Refreshing state... [id=agi-sse4jppfz8-tszbth-POST]
module.sbeacon.aws_api_gateway_integration.individuals-id-g_variants: Refreshing state... [id=agi-sse4jppfz8-3p7266-GET]
module.sbeacon.aws_api_gateway_integration.individuals: Refreshing state... [id=agi-sse4jppfz8-tszbth-GET]
module.sbeacon.aws_api_gateway_integration.individuals-id_post: Refreshing state... [id=agi-sse4jppfz8-2jfdqa-POST]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-analyses: Refreshing state... [id=agir-sse4jppfz8-5z5zup-GET-200]
module.sbeacon.aws_api_gateway_integration.individuals-id-biosamples: Refreshing state... [id=agi-sse4jppfz8-cbna1t-GET]
module.sbeacon.aws_api_gateway_integration.individuals-id-biosamples_post: Refreshing state... [id=agi-sse4jppfz8-cbna1t-POST]
module.sbeacon.aws_api_gateway_integration.individuals-filtering_terms_post: Refreshing state... [id=agi-sse4jppfz8-2jwps9-POST]
module.sbeacon.aws_api_gateway_integration.individuals-filtering_terms: Refreshing state... [id=agi-sse4jppfz8-2jwps9-GET]
module.sbeacon.aws_lambda_permission.APIindividualsIdg_variants: Refreshing state... [id=AllowAPIindividualsIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIindividualsIdbiosamples: Refreshing state... [id=AllowAPIindividualsIdbiosamplesInvoke]
module.sbeacon.aws_api_gateway_integration.individuals-id: Refreshing state... [id=agi-sse4jppfz8-2jfdqa-GET]
module.sbeacon.aws_lambda_permission.APIindividualsFilteringTerms: Refreshing state... [id=AllowAPIindividualsFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIindividualsId: Refreshing state... [id=AllowAPIindividualsIdInvoke]
module.sbeacon.aws_api_gateway_integration.individuals-id-g_variants_post: Refreshing state... [id=agi-sse4jppfz8-3p7266-POST]
module.sbeacon.aws_lambda_permission.APIindividuals: Refreshing state... [id=AllowAPIindividualsInvoke]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-runs_post: Refreshing state... [id=agir-sse4jppfz8-0omln3-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-runs: Refreshing state... [id=agir-sse4jppfz8-0omln3-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id-g_variants: Refreshing state... [id=agir-sse4jppfz8-q3gd41-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id-g_variants_post: Refreshing state... [id=agir-sse4jppfz8-q3gd41-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses: Refreshing state... [id=agir-sse4jppfz8-ix2myj-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id: Refreshing state... [id=agir-sse4jppfz8-m5i90n-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id_post: Refreshing state... [id=agir-sse4jppfz8-m5i90n-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-filtering_terms: Refreshing state... [id=agir-sse4jppfz8-eylaw8-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-filtering_terms_post: Refreshing state... [id=agir-sse4jppfz8-eylaw8-POST-200]
module.sbeacon.aws_api_gateway_integration.admin_proxy: Refreshing state... [id=agi-sse4jppfz8-yrayho-ANY]
module.sbeacon.aws_lambda_permission.APIadmin_proxy: Refreshing state... [id=AllowAPIadmin_proxyInvoke]
module.sbeacon.aws_api_gateway_integration.datasets: Refreshing state... [id=agi-sse4jppfz8-7qllhx-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id_post: Refreshing state... [id=agi-sse4jppfz8-988914-POST]
module.sbeacon.aws_api_gateway_integration.datasets_post: Refreshing state... [id=agi-sse4jppfz8-7qllhx-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-biosamples: Refreshing state... [id=agi-sse4jppfz8-gwc4y7-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-individuals_post: Refreshing state... [id=agi-sse4jppfz8-hbsf0m-POST]
module.sbeacon.aws_api_gateway_integration.datasets-filtering_terms: Refreshing state... [id=agi-sse4jppfz8-gwxbpd-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-filtering_terms_post: Refreshing state... [id=agi-sse4jppfz8-pjr8lx-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id: Refreshing state... [id=agi-sse4jppfz8-988914-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-g_variants_post: Refreshing state... [id=agi-sse4jppfz8-p0v24v-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-filtering_terms: Refreshing state... [id=agi-sse4jppfz8-pjr8lx-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-individuals: Refreshing state... [id=agi-sse4jppfz8-hbsf0m-GET]
module.sbeacon.aws_api_gateway_integration.datasets-filtering_terms_post: Refreshing state... [id=agi-sse4jppfz8-gwxbpd-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-biosamples_post: Refreshing state... [id=agi-sse4jppfz8-gwc4y7-POST]
module.sbeacon.aws_lambda_permission.APIdatasetsFilteringTerms: Refreshing state... [id=AllowAPIdatasetsFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasets: Refreshing state... [id=AllowAPIdatasetsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdg_variants: Refreshing state... [id=AllowAPIdatasetsIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdindividuals: Refreshing state... [id=AllowAPIdatasetsIdindividualsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdbiosamples: Refreshing state... [id=AllowAPIdatasetsIdbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsId: Refreshing state... [id=AllowAPIdatasetsIdInvoke]
module.sbeacon.aws_api_gateway_integration.runs-id: Refreshing state... [id=agi-sse4jppfz8-fps4t7-GET]
module.sbeacon.aws_api_gateway_integration.runs-id-g_variants_post: Refreshing state... [id=agi-sse4jppfz8-ih2jru-POST]
module.sbeacon.aws_lambda_permission.APIrunsId: Refreshing state... [id=AllowAPIrunsIdInvoke]
module.sbeacon.aws_lambda_permission.APIrunsFilteringTerms: Refreshing state... [id=AllowAPIrunsFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdfiltering_terms: Refreshing state... [id=AllowAPIdatasetsIdfiltering_termsInvoke]
module.sbeacon.aws_lambda_permission.APIrunsIdg_variants: Refreshing state... [id=AllowAPIrunsIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIruns: Refreshing state... [id=AllowAPIrunsInvoke]
module.sbeacon.aws_api_gateway_integration.runs-id-analyses_post: Refreshing state... [id=agi-sse4jppfz8-rt4ilc-POST]
module.sbeacon.aws_api_gateway_integration.runs: Refreshing state... [id=agi-sse4jppfz8-6nxeg0-GET]
module.sbeacon.aws_api_gateway_integration.runs-id_post: Refreshing state... [id=agi-sse4jppfz8-fps4t7-POST]
module.sbeacon.aws_api_gateway_integration.runs-filtering_terms_post: Refreshing state... [id=agi-sse4jppfz8-k5ywtx-POST]
module.sbeacon.aws_api_gateway_integration.runs-id-g_variants: Refreshing state... [id=agi-sse4jppfz8-ih2jru-GET]
module.sbeacon.aws_api_gateway_integration.runs-id-analyses: Refreshing state... [id=agi-sse4jppfz8-rt4ilc-GET]
module.sbeacon.aws_lambda_permission.APIrunsIdanalyses: Refreshing state... [id=AllowAPIrunsIdanalysesInvoke]
module.sbeacon.aws_api_gateway_integration.runs_post: Refreshing state... [id=agi-sse4jppfz8-6nxeg0-POST]
module.sbeacon.aws_lambda_permission.APIdportal_proxy: Refreshing state... [id=AllowAPIdportal_proxyInvoke]
module.sbeacon.aws_lambda_permission.APIg_variantsId: Refreshing state... [id=AllowAPIg_variantsIdInvoke]
module.sbeacon.aws_lambda_permission.APIg_variantsIdindividuals: Refreshing state... [id=AllowAPIg_variantsIdindividualsInvoke]
module.sbeacon.aws_lambda_permission.APIg_variantsIdbiosamples: Refreshing state... [id=AllowAPIg_variantsIdbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIg_variants: Refreshing state... [id=AllowAPIg_variantsInvoke]
module.sbeacon.aws_api_gateway_integration.dportal_proxy: Refreshing state... [id=agi-sse4jppfz8-jsr0cp-ANY]
module.sbeacon.aws_api_gateway_integration.g_variants-id-individuals_post: Refreshing state... [id=agi-sse4jppfz8-ngo9l8-POST]
module.sbeacon.aws_api_gateway_integration.g_variants-id: Refreshing state... [id=agi-sse4jppfz8-4k5xwj-GET]
module.sbeacon.aws_api_gateway_integration.g_variants: Refreshing state... [id=agi-sse4jppfz8-xadyn3-GET]
module.sbeacon.aws_api_gateway_integration.g_variants-id-individuals: Refreshing state... [id=agi-sse4jppfz8-ngo9l8-GET]
module.sbeacon.aws_api_gateway_integration.g_variants-id_post: Refreshing state... [id=agi-sse4jppfz8-4k5xwj-POST]
module.sbeacon.aws_api_gateway_integration.g_variants_post: Refreshing state... [id=agi-sse4jppfz8-xadyn3-POST]
module.sbeacon.aws_api_gateway_integration.g_variants-id-biosamples: Refreshing state... [id=agi-sse4jppfz8-eu5xf3-GET]
module.sbeacon.aws_api_gateway_integration.g_variants-id-biosamples_post: Refreshing state... [id=agi-sse4jppfz8-eu5xf3-POST]
module.sbeacon.aws_api_gateway_integration_response.individuals_post: Refreshing state... [id=agir-sse4jppfz8-tszbth-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals: Refreshing state... [id=agir-sse4jppfz8-tszbth-GET-200]
module.svep[0].aws_api_gateway_deployment.VPApi: Refreshing state... [id=ltrl0s]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-biosamples: Refreshing state... [id=agir-sse4jppfz8-cbna1t-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-biosamples_post: Refreshing state... [id=agir-sse4jppfz8-cbna1t-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-filtering_terms_post: Refreshing state... [id=agir-sse4jppfz8-2jwps9-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-filtering_terms: Refreshing state... [id=agir-sse4jppfz8-2jwps9-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id_post: Refreshing state... [id=agir-sse4jppfz8-cj0t4v-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-g_variants_post: Refreshing state... [id=agir-sse4jppfz8-3p7266-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-g_variants: Refreshing state... [id=agir-sse4jppfz8-5pywyj-GET-200]
module.sbeacon.aws_api_gateway_integration_response.admin_proxy: Refreshing state... [id=agir-sse4jppfz8-yrayho-ANY-200]
module.sbeacon.aws_api_gateway_integration_response.datasets: Refreshing state... [id=agir-sse4jppfz8-7qllhx-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id_post: Refreshing state... [id=agir-sse4jppfz8-988914-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-biosamples: Refreshing state... [id=agir-sse4jppfz8-gwc4y7-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-individuals_post: Refreshing state... [id=agir-sse4jppfz8-hbsf0m-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-g_variants: Refreshing state... [id=agir-sse4jppfz8-3p7266-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-filtering_terms: Refreshing state... [id=agir-sse4jppfz8-gwxbpd-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-filtering_terms_post: Refreshing state... [id=agir-sse4jppfz8-pjr8lx-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id: Refreshing state... [id=agir-sse4jppfz8-988914-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-g_variants_post: Refreshing state... [id=agir-sse4jppfz8-p0v24v-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-individuals: Refreshing state... [id=agir-sse4jppfz8-hbsf0m-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-filtering_terms_post: Refreshing state... [id=agir-sse4jppfz8-gwxbpd-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-biosamples_post: Refreshing state... [id=agir-sse4jppfz8-gwc4y7-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id: Refreshing state... [id=agir-sse4jppfz8-fps4t7-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-g_variants_post: Refreshing state... [id=agir-sse4jppfz8-ih2jru-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs: Refreshing state... [id=agir-sse4jppfz8-6nxeg0-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-analyses_post: Refreshing state... [id=agir-sse4jppfz8-rt4ilc-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-filtering_terms_post: Refreshing state... [id=agir-sse4jppfz8-k5ywtx-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id_post: Refreshing state... [id=agir-sse4jppfz8-fps4t7-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-g_variants: Refreshing state... [id=agir-sse4jppfz8-ih2jru-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-analyses: Refreshing state... [id=agir-sse4jppfz8-rt4ilc-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs_post: Refreshing state... [id=agir-sse4jppfz8-6nxeg0-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses_post: Refreshing state... [id=agir-sse4jppfz8-ix2myj-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id: Refreshing state... [id=agir-sse4jppfz8-4k5xwj-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-filtering_terms: Refreshing state... [id=agir-sse4jppfz8-pjr8lx-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id: Refreshing state... [id=agir-sse4jppfz8-2jfdqa-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets_post: Refreshing state... [id=agir-sse4jppfz8-7qllhx-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants_post: Refreshing state... [id=agir-sse4jppfz8-xadyn3-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-biosamples: Refreshing state... [id=agir-sse4jppfz8-eu5xf3-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-biosamples_post: Refreshing state... [id=agir-sse4jppfz8-eu5xf3-POST-200]
module.sbeacon.aws_api_gateway_integration_response.dportal_proxy: Refreshing state... [id=agir-sse4jppfz8-jsr0cp-ANY-200]
module.svep[0].aws_api_gateway_stage.VPApi: Refreshing state... [id=ags-49hervuih0-prod]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id_post: Refreshing state... [id=agir-sse4jppfz8-4k5xwj-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants: Refreshing state... [id=agir-sse4jppfz8-xadyn3-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-individuals_post: Refreshing state... [id=agir-sse4jppfz8-ngo9l8-POST-200]
module.svep[0].aws_api_gateway_method_settings.VPApi: Refreshing state... [id=49hervuih0-prod-*/*]
module.svep[0].aws_cloudfront_distribution.api_distribution: Refreshing state... [id=EK9X29NIBHFHI]
module.sbeacon.aws_api_gateway_integration_response.individuals-id_post: Refreshing state... [id=agir-sse4jppfz8-2jfdqa-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-individuals: Refreshing state... [id=agir-sse4jppfz8-ngo9l8-GET-200]
module.sbeacon.aws_api_gateway_method_response.runs-filtering_terms: Refreshing state... [id=agmr-sse4jppfz8-k5ywtx-GET-200]
module.sbeacon.aws_api_gateway_integration.runs-filtering_terms: Refreshing state... [id=agi-sse4jppfz8-k5ywtx-GET]
module.sbeacon.aws_api_gateway_integration_response.runs-filtering_terms: Refreshing state... [id=agir-sse4jppfz8-k5ywtx-GET-200]
module.sbeacon.aws_api_gateway_method_response.datasets-id-g_variants: Refreshing state... [id=agmr-sse4jppfz8-p0v24v-GET-200]
module.sbeacon.aws_api_gateway_integration.datasets-id-g_variants: Refreshing state... [id=agi-sse4jppfz8-p0v24v-GET]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-g_variants: Refreshing state... [id=agir-sse4jppfz8-p0v24v-GET-200]
module.sbeacon.aws_api_gateway_deployment.BeaconApi: Refreshing state... [id=jb3b0u]
module.sbeacon.aws_api_gateway_stage.BeaconApi: Refreshing state... [id=ags-sse4jppfz8-prod]
module.sbeacon.aws_api_gateway_method_settings.BeaconApi: Refreshing state... [id=sse4jppfz8-prod-*/*]
module.sbeacon.aws_cloudfront_distribution.api_distribution: Refreshing state... [id=E20FL5HAUF8L1Y]
module.webgui.data.external.build: Reading...
module.webgui.aws_cloudfront_response_headers_policy.bui-security-headers-policy: Refreshing state... [id=a6381278-82e0-412f-b296-65e14e230d9b]
module.webgui.aws_cloudfront_distribution.bui-s3-distribution: Refreshing state... [id=E2LJ0IIK862SQ0]
module.webgui.data.aws_iam_policy_document.s3_access_from_cloudfront: Reading...
module.webgui.data.aws_iam_policy_document.s3_access_from_cloudfront: Read complete after 0s [id=2982019768]
module.webgui.aws_ssm_parameter.bui-ssm-beacon-ui-url: Refreshing state... [id=bui-ssm-beacon-ui-url]
module.webgui.aws_s3_bucket_policy.s3_access_from_cloudfront: Refreshing state... [id=webgui-bucket-20250524134912733100000001]
module.webgui.data.external.build: Still reading... [10s elapsed]
module.webgui.data.external.build: Still reading... [20s elapsed]
module.webgui.data.external.build: Still reading... [30s elapsed]
module.webgui.data.external.build: Still reading... [40s elapsed]
module.webgui.data.external.build: Still reading... [50s elapsed]
module.webgui.data.external.build: Still reading... [1m0s elapsed]
module.webgui.data.external.build: Still reading... [1m10s elapsed]
module.webgui.data.external.build: Still reading... [1m20s elapsed]
module.webgui.data.external.build: Still reading... [1m30s elapsed]
module.webgui.data.external.build: Read complete after 1m32s [id=-]
module.webgui.null_resource.s3-upload: Refreshing state... [id=6719585621058372774]
module.webgui.null_resource.cloudfront-invalidate: Refreshing state... [id=3996702766241245563]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_image.this has been deleted
  - resource "docker_image" "this" {
        id           = "sha256:d4fa5120a595cb9185e14e1e3aa0dc63a21c5eccddcd1f1f34b84c7b84027e9d127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      - image_id     = "sha256:d4fa5120a595cb9185e14e1e3aa0dc63a21c5eccddcd1f1f34b84c7b84027e9d" -> null
      - name         = "127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers" -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.svep[0].module.docker_image_pluginConsequence_lambda.docker_image.this has been deleted
  - resource "docker_image" "this" {
        id           = "sha256:859709e8522c393900ed8223175739f24e5162b3f2f9fe33135845a98ad4d73e127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers"
      - image_id     = "sha256:859709e8522c393900ed8223175739f24e5162b3f2f9fe33135845a98ad4d73e" -> null
      - name         = "127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers" -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.svep[0].module.docker_image_qcFigures_lambda.docker_image.this has been deleted
  - resource "docker_image" "this" {
        id           = "sha256:ecd322a3209d050aa0cbe3b7474035ec59206e8d1a5a88e5d0bc4a5be8047f0a127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers"
      - image_id     = "sha256:ecd322a3209d050aa0cbe3b7474035ec59206e8d1a5a88e5d0bc4a5be8047f0a" -> null
      - name         = "127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers" -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # aws_backup_plan.gaspi_backup_plan will be created
  + resource "aws_backup_plan" "gaspi_backup_plan" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "gaspi_backup_plan"
      + tags     = {
          + "Environment" = "uat"
          + "Owner"       = "gaspi"
        }
      + tags_all = {
          + "Environment" = "uat"
          + "Owner"       = "gaspi"
        }
      + version  = (known after apply)

      + rule {
          + completion_window            = 180
          + enable_continuous_backup     = false
          + rule_name                    = "weekly"
          + schedule                     = "cron(0 20 ? * SUN *)"
          + schedule_expression_timezone = "Etc/UTC"
          + start_window                 = 60
          + target_vault_name            = "gaspi_backup_vault"

          + lifecycle {
              + delete_after                              = 30
              + opt_in_to_archive_for_supported_resources = (known after apply)
            }
        }
      + rule {
          + completion_window            = 180
          + enable_continuous_backup     = false
          + rule_name                    = "yearly"
          + schedule                     = "cron(0 22 1 1 ? *)"
          + schedule_expression_timezone = "Etc/UTC"
          + start_window                 = 60
          + target_vault_name            = "gaspi_backup_vault"

          + lifecycle {
              + delete_after                              = 3650
              + opt_in_to_archive_for_supported_resources = (known after apply)
            }
        }
      + rule {
          + completion_window            = 180
          + enable_continuous_backup     = false
          + rule_name                    = "monthly"
          + schedule                     = "cron(0 21 1 * ? *)"
          + schedule_expression_timezone = "Etc/UTC"
          + start_window                 = 60
          + target_vault_name            = "gaspi_backup_vault"

          + lifecycle {
              + delete_after                              = 365
              + opt_in_to_archive_for_supported_resources = (known after apply)
            }
        }
      + rule {
          + completion_window            = 180
          + enable_continuous_backup     = false
          + rule_name                    = "daily"
          + schedule                     = "cron(0 19 * * ? *)"
          + schedule_expression_timezone = "Etc/UTC"
          + start_window                 = 60
          + target_vault_name            = "gaspi_backup_vault"

          + lifecycle {
              + delete_after                              = 7
              + opt_in_to_archive_for_supported_resources = (known after apply)
            }
        }
    }

  # aws_backup_selection.gaspi_backup_selection will be created
  + resource "aws_backup_selection" "gaspi_backup_selection" {
      + iam_role_arn  = (known after apply)
      + id            = (known after apply)
      + name          = "gaspi_backup_resource_selection"
      + not_resources = (known after apply)
      + plan_id       = (known after apply)

      + condition (known after apply)

      + selection_tag {
          + key   = "backup"
          + type  = "STRINGEQUALS"
          + value = "true"
        }
    }

  # aws_backup_vault.gaspi_backup_vault will be created
  + resource "aws_backup_vault" "gaspi_backup_vault" {
      + arn             = (known after apply)
      + force_destroy   = false
      + id              = (known after apply)
      + kms_key_arn     = (known after apply)
      + name            = "gaspi_backup_vault"
      + recovery_points = (known after apply)
      + tags            = {
          + "Environment" = "uat"
          + "Owner"       = "gaspi"
        }
      + tags_all        = {
          + "Environment" = "uat"
          + "Owner"       = "gaspi"
        }
    }

  # aws_iam_role.gaspi_backup_role will be created
  + resource "aws_iam_role" "gaspi_backup_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "backup.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "gaspi_backup_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.gaspi_backup_role_attachment will be created
  + resource "aws_iam_role_policy_attachment" "gaspi_backup_role_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSBackupServiceRolePolicyForBackup"
      + role       = "gaspi_backup_role"
    }

  # aws_iam_role_policy_attachment.gaspi_backup_s3_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "gaspi_backup_s3_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSBackupServiceRolePolicyForS3Backup"
      + role       = "gaspi_backup_role"
    }

  # aws_iam_role_policy_attachment.gaspi_restore_s3_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "gaspi_restore_s3_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSBackupServiceRolePolicyForS3Restore"
      + role       = "gaspi_backup_role"
    }

  # module.sbeacon.data.aws_iam_policy_document.admin-lambda-access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "admin-lambda-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "cognito-idp:*",
            ]
          + resources = [
              + "arn:aws:cognito-idp:ap-southeast-3:127214202110:userpool/ap-southeast-3_586AXnWYN",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:GetItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
            ]
          + resour
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.